pe016/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U ( 0 0 0 )
    volScalarFieldValue T 100
    volScalarFieldValue p 6895 
);


regions
(
    boxToCell
    {
        box ( 0.127 -1 -1 ) ( 10 1 1 );
        fieldValues
	(
            volScalarFieldValue T 100
            volScalarFieldValue p 1103
        );
    }
);


// ************************************************************************* //
